<?php
/*!
@file member_detail_smarty.php
@brief メンバー詳細(Smarty版)
@copyright Copyright (c) 2017 Yamanoi Yasushi.
*/

/////////////////////////////////////////////////////////////////
/// 実行ブロック
/////////////////////////////////////////////////////////////////

$show_mode = '';
$ERR_STR = '';

//ページの設定
//デフォルトは1
$page = 1;
//もしページが指定されていたら
if(isset($_GET['page']) 
    //なおかつ、数字だったら
    && cutil::is_number($_GET['page'])
    //なおかつ、0より大きかったら
    && $_GET['page'] > 0){
    //パラメータを設定
    $page = $_GET['page'];
}

$show_mode = 'edit';
//データの読み込み
readdata();

/////////////////////////////////////////////////////////////////
/// 関数ブロック
/////////////////////////////////////////////////////////////////

//--------------------------------------------------------------------------------------
/*!
@brief  コマンドが渡されたかどうか
@return 渡されたらtrue
*/
//--------------------------------------------------------------------------------------
function is_func_active(){
    if(isset($_POST['func']) && $_POST['func'] != ""){
        return true;
    }
    return false;
}


//--------------------------------------------------------------------------------------
/*!
@brief  パラメータのチェック
@return エラーがあったらfalse
*/
//--------------------------------------------------------------------------------------
function param_chk(){
     global $ERR_STR;
    if(!isset($_POST['param']) 
    || !cutil::is_number($_POST['param'])
    || $_POST['param'] <= 0){
        $ERR_STR .= "パラメータを取得できませんでした\n";
        return false;
    }
    return true;
}


//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
// function readdata(){
//     
//     
//     $obj = new cuser();
//     $from = ($page - 1) * $limit;
//     $rows = $obj->get_all_count(false,$from,$limit);
// }
//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
// function readdata(){
//     $obj = new cuser();
//     $from = ($page - 1) * $limit;
//     $rows = $obj->get_all(false,$from,$limit);
// }
//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
// function readdata(){
//      $obj = new cuser();
//      $from = ($page - 1) * $limit;
//      $rows = $obj->get_tgt(false,$from,$limit);
// }
//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
// function readdata(){
//      $obj = new cuser();
//      $from = ($page - 1) * $limit;
//      $rows = $obj->get_tgt_sougi(false,$from,$limit);
// }
//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
function readdata(){
     $obj = new cuser();
     $from = ($page - 1) * $limit;
     $rows = $obj->get_tgt_plan(false,$from,$limit);
}
//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
// function readdata(){
//     $obj = new cuser();
//     $from = ($page - 1) * $limit;
//     $rows = $obj->get_tgt_plan1(false,$from,$limit);
// }
//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
// function readdata(){
//     $obj = new cuser();
//     $from = ($page - 1) * $limit;
//     $rows = $obj->get_tgt_plan2(false,$from,$limit);
// }
//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
// function readdata(){
//     $obj = new cuser();
//     $from = ($page - 1) * $limit;
//     $rows = $obj->get_tgt_plan3(false,$from,$limit);
// }
//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
// function readdata(){
//     $obj = new cuser();
//     $from = ($page - 1) * $limit;
//     $rows = $obj->get_tgt_plan4(false,$from,$limit);
// }
//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
// function readdata(){
//     $obj = new cuser();
//     $from = ($page - 1) * $limit;
//     $rows = $obj->get_tgt_plan5(false,$from,$limit);
// }
//--------------------------------------------------------------------------------------
/*!
@brief  データ読み込み
@return なし
*/
//--------------------------------------------------------------------------------------
// function readdata(){
    
    
//     $obj = new cuser();
//     $from = ($page - 1) * $limit;
//     $rows = $obj->get_tgt_id(false,$from,$limit);
// }
//--------------------------------------------------------------------------------------
/*!
@brief  削除
@return なし
*/
//--------------------------------------------------------------------------------------
function deljob(){
    $chenge = new cchange_ex();
    if($_POST['param'] > 0){
        $chenge->delete("user","user_id=" . $_POST['param']);
    }
}


//--------------------------------------------------------------------------------------
/*!
@brief  ページャーのアサイン
@return なし
*/
//--------------------------------------------------------------------------------------
function assign_page_block(){
    //$smartyをグローバル宣言（必須）
    global $smarty;
    global $limit;
    
    $retstr = '';
    $obj = new cuser();
    $allcount = $obj->get_all_count(false);
    $ctl = new cpager($_SERVER['PHP_SELF'],$allcount,$limit);
    $smarty->assign('pager_arr',$ctl->get('page',$page));
}


//--------------------------------------------------------------------------------------
/*!
@brief  一覧のアサイン
@return なし
*/
//--------------------------------------------------------------------------------------
function assign_member_list(){
    //$smartyをグローバル宣言（必須）
    global $smarty;
    
    $smarty->assign('rows',$rows);
}

//--------------------------------------------------------------------------------------
/*!
@brief  URIのアサイン
@return なし
*/
//--------------------------------------------------------------------------------------
function assign_tgt_uri(){
    //$smartyをグローバル宣言（必須）
    global $smarty;
    
    $smarty->assign('tgt_uri',$_SERVER['PHP_SELF'] . '?page=' . $page);
}

/////////////////////////////////////////////////////////////////
/// 関数呼び出しブロック
/////////////////////////////////////////////////////////////////
$smarty->assign('ERR_STR',$ERR_STR);
assign_page_block();
assign_member_list();
assign_tgt_uri();

//Smartyを使用した表示(テンプレートファイルの指定)
$smarty->display('admin/u_plan.tmpl');


?>